Revit 2024 API
eRefFace Enumeration
Indicates the reference face. The Opening will be created at the direction perpendicular to the reference face.
Namespace: Autodesk.Revit.Creation
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public enum eRefFace
Visual Basic
Public Enumeration eRefFace
Visual C++
public enum class eRefFace
Members
Member name | Description
CenterX | The reference face is at the middle of the element in the direction of x-axis and its normal is parallel to x-axis.
CenterY | The reference face is at the middle of the element in the direction of y-axis and its normal is parallel to y-axis.
CenterZ | The reference face is at the middle of the element in the direction of z-axis and its normal is parallel to z-axis.
Remarks
Direction of the opening.
See Also
Autodesk.Revit.Creation Namespace